<a href="https://colab.research.google.com/github/varun2068/Data-Science/blob/main/Week_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#**Pandas**

In [89]:
 import pandas as pd

In [ ]:
students = ['Alice', 'Jack', 'Molly']
pd.Series(students)

0    Alice
1     Jack
2    Molly
dtype: object

In [ ]:
numbers = [1, 2, 3]
pd.Series(numbers)

0    1
1    2
2    3
dtype: int64

In [ ]:
students = ['Alice', 'Jack', None]
pd.Series(students)

0    Alice
1     Jack
2     None
dtype: object

In [ ]:
numbers = [1, 2, None]
pd.Series(numbers)
#if data is missing from a list python change its type  to float as seen

0    1.0
1    2.0
2    NaN
dtype: float64

In [ ]:
student_scores = {
    'Alice' : 'Physics',
    'Molly' : 'English',
    'Jack' : 'Chemistry'
}
s = pd.Series(student_scores)
s

Alice      Physics
Molly      English
Jack     Chemistry
dtype: object

In [ ]:
s.index

Index(['Alice', 'Molly', 'Jack'], dtype='object')

In [ ]:
students = [("Alice", "Brown"), ("Jack", "Blue"), ("Molly", "Yellow")]
pd.Series(students)

0     (Alice, Brown)
1       (Jack, Blue)
2    (Molly, Yellow)
dtype: object

In [ ]:
stud = pd.Series(['Physics', 'Chemistry', "Biology"], index=['Alice', 'Jack', 'Mooly'])
stud

Alice      Physics
Jack     Chemistry
Mooly      Biology
dtype: object

In [ ]:
student_scores = {
    'Alice' : 'Physics',
    'Molly' : 'English',
    'Jack' : 'Chemistry'
}
s = pd.Series(student_scores,  index=['Alice', 'Jack', 'Sam'])
s

Alice      Physics
Jack     Chemistry
Sam            NaN
dtype: object

As sam is not in the dictionary *student_scores* that's why when we use pandas to make it Series it will show Alice and Jack and Sam value as Nan because it doesn't exist in the dictionary

##**Querying In Series**

In [ ]:
student_classes = {
    'Alice' : 'Physics',
    'Molly' : 'English',
    'Jack' : 'Chemistry',
    'Sam' : 'Biology'
}
s = pd.Series(student_classes)
s

Alice      Physics
Molly      English
Jack     Chemistry
Sam        Biology
dtype: object

In [ ]:
s.iloc[2]

'Chemistry'

In [ ]:
s.loc['Molly']

'English'

```iloc``` and ```loc``` are not methods, they are attributes. So you don't use parenthesis to query them, but square brackets instead, which is called indexing operator.

In [ ]:
s[2]

'Chemistry'

In [ ]:
s['Sam']

'Biology'

In [ ]:
sub_code = {
    99 : 'Physics',
    102 : 'English',
    100 : 'Chemistry',
    101 : 'Biology'
}
s = pd.Series(sub_code)
s

99       Physics
102      English
100    Chemistry
101      Biology
dtype: object

In [ ]:
s[0]

KeyError: ignored

In [ ]:
grades = pd.Series([90, 80, 70, 60])

total = 0
for grade in grades:
  total += grade

print(total/len(grades))

75.0

In [ ]:
import numpy as np

total = np.sum(grades)
print(total/len(grades))

75.0

In [ ]:
numbers = pd.Series(np.random.randint(0, 1000, 10000))
numbers

0       780
1       280
2       641
3       674
4       298
       ...
9995    745
9996    981
9997    184
9998    146
9999    186
Length: 10000, dtype: int64

In [ ]:
numbers.head() # it gives the first five entries of the Series

0    780
1    280
2    641
3    674
4    298
dtype: int64

In [ ]:
len(numbers)

10000

In [ ]:
%%timeit -n 100
total = 0
for number in numbers:
  total += number

total/len(numbers)

100 loops, best of 5: 1.27 ms per loop

In [ ]:
%%timeit -n 100
total = np.sum(numbers)
total / len(numbers)

100 loops, best of 5: 65.9 µs per loop

In [ ]:
numbers += 2

In [ ]:
numbers.head()

0    782
1    282
2    643
3    676
4    300
dtype: int64

In [ ]:
for label, value in numbers.iteritems():
  numbers.iat(label, value+2)

numbers.head()

TypeError: ignored

In [ ]:
%%timeit -n 10
s = pd.Series(np.random.randint(0, 1000, 1000))
for label, value in s.iteritems():
  s.loc[label] = value+2

10 loops, best of 5: 48.2 ms per loop

In [ ]:
%%timeit -n 10
s = pd.Series(np.random.randint(0, 1000, 1000))
s += 2

10 loops, best of 5: 251 µs per loop

In [ ]:
s = pd.Series([1, 2, 3])
s.loc['History'] = 102
s

0            1
1            2
2            3
History    102
dtype: int64

In [ ]:
students = pd.Series({
    'Alice' : 'Physics',
    'Molly' : 'English',
    'Jack' : 'Chemistry',
    'Sam': 'Biology'
})
students

Alice      Physics
Molly      English
Jack     Chemistry
Sam        Biology
dtype: object

In [ ]:
classes = pd.Series(['Philosophy', 'Arts', 'Math'], index=['Kelly', "Kelly", "Kelly"])
classes

Kelly    Philosophy
Kelly          Arts
Kelly          Math
dtype: object

In [ ]:
all_students = students.append(classes)
all_students

Alice       Physics
Molly       English
Jack      Chemistry
Sam         Biology
Kelly    Philosophy
Kelly          Arts
Kelly          Math
dtype: object

In [ ]:
all_students.loc['Kelly']

Kelly    Philosophy
Kelly          Arts
Kelly          Math
dtype: object

##**Data Frame**

In [ ]:
record1 = pd.Series({
    'Name' : 'Alice',
    'Class' : 'Physics',
    'Score' : 90
})
record2 = pd.Series({
    'Name' : 'Jack',
    'Class' : 'Chemistry',
    'Score' : 95
})
record3 = pd.Series({
    'Name' : 'Helen',
    'Class' : 'Biology',
    'Score' : 85
})

In [ ]:
df = pd.DataFrame([record1, record2, record3], index=['School1', 'School2', 'School3'])
df.head()

          Name      Class  Score
School1  Alice    Physics     90
School2   Jack  Chemistry     95
School3  Helen    Biology     85

In [ ]:
students = [{
    'Name' : 'Alice',
    'Class' : 'Physics',
    'Score' : 90},
    {'Name' : 'Helen',
    'Class' : 'Biology',
    'Score' : 85},
    {
    'Name' : 'Jack',
    'Class' : 'Chemistry',
    'Score' : 95}]
df = pd.DataFrame(students, index=['School1', 'School1', 'School3'])
df

          Name      Class  Score
School1  Alice    Physics     90
School1  Helen    Biology     85
School3   Jack  Chemistry     95

In [ ]:
df.loc['School2']

Name       Helen
Class    Biology
Score         85
Name: School2, dtype: object

In [ ]:
type(df.loc['School2'])

pandas.core.series.Series

In [ ]:
df.loc['School1']

          Name    Class  Score
School1  Alice  Physics     90
School1  Helen  Biology     85

In [ ]:

type(df.loc['School1'])

pandas.core.frame.DataFrame

If there are duplicates in a data frame then the type shown is ```pandas.core.frame.DataFrame``` but if all data is unique then it show ```pandas.core.series.Series```

In [ ]:
df.loc['Name']

School1    Alice
School1    Helen
Name: Name, dtype: object

In [ ]:
#transpose of the dataFrame 
df.T

       School1  School1    School3
Name     Alice    Helen       Jack
Class  Physics  Biology  Chemistry
Score       90       85         95

In [ ]:
df.T.loc["Name"]

School1    Alice
School1    Helen
School3     Jack
Name: Name, dtype: object

In [ ]:
df['Name']

School1    Alice
School1    Helen
School3     Jack
Name: Name, dtype: object

In [ ]:
df.loc['School1']['Name']

School1    Alice
School1    Helen
Name: Name, dtype: object

In [ ]:
print(type(df.loc['School1']))
print(type(df.loc['School1']['Name']))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

In [ ]:
df.loc[:,['Name', 'Score']]

          Name  Score
School1  Alice     90
School1  Helen     85
School3   Jack     95

In [ ]:
df.drop('School1')

         Name      Class  Score
School3  Jack  Chemistry     95

In [ ]:
df

          Name      Class  Score
School1  Alice    Physics     90
School1  Helen    Biology     85
School3   Jack  Chemistry     95

In [ ]:
copy_df = df.copy()

In [ ]:
copy_df.drop("Name", inplace=True, axis=1)
copy_df

             Class  Score
School1    Physics     90
School1    Biology     85
School3  Chemistry     95

In [ ]:
del copy_df['Class']

In [ ]:
copy_df

         Score
School1     90
School1     85
School3     95

In [ ]:
df['Class Ranking'] = None
df

          Name      Class  Score Class Ranking
School1  Alice    Physics     90          None
School1  Helen    Biology     85          None
School3   Jack  Chemistry     95          None

##**Indexing and Loading**

In [5]:
!cat Admission_Predict.csv

cat: Admission_Predict.csv: No such file or directory

In [29]:
df = pd.read_csv('Admission_Predict.csv')
df.head()

   Serial No.  GRE Score  TOEFL Score  ...  CGPA  Research  Chance of Admit
0           1        337          118  ...  9.65         1              0.92
1           2        324          107  ...  8.87         1              0.76
2           3        316          104  ...  8.00         1              0.72
3           4        322          110  ...  8.67         1              0.80
4           5        314          103  ...  8.21         0              0.65

[5 rows x 9 columns]

In [30]:
df = pd.read_csv('Admission_Predict.csv', index_col=0)
df.head()

            GRE Score  TOEFL Score  ...  Research  Chance of Admit
Serial No.                          ...
1                 337          118  ...         1              0.92
2                 324          107  ...         1              0.76
3                 316          104  ...         1              0.72
4                 322          110  ...         1              0.80
5                 314          103  ...         0              0.65

[5 rows x 8 columns]

In [ ]:
new_df = new_df.rename(columns={'GRE Score':'GRE Score',
                            'TOEFL SCore': 'TOEFL SCore',
                            'University Ranking': 'University Ranking',
                            'SOP': 'Statement of Purpose',
                            'LOR': 'Letter of Recommendation',
                            'CGPA': 'CGPA',
                            'Research':'Research',
                            'Chance of Admit':'Chance of Admit'})
new_df.head()

            GRE Score  TOEFL Score  ...  Research  Chance of Admit
Serial No.                          ...
1                 337          118  ...         1              0.92
2                 324          107  ...         1              0.76
3                 316          104  ...         1              0.72
4                 322          110  ...         1              0.80
5                 314          103  ...         0              0.65

[5 rows x 8 columns]

As seen SOP is changed but LOR remains same

In [ ]:
new_df.columns

Index(['GRE Score', 'TOEFL Score', 'University Rating', 'Statement of Purpose',
       'Letter of Recommendation', 'CGPA', 'Research', 'Chance of Admit '],
      dtype='object')

As seen above *LOR has an extra space at right side* Like after *Chance for Admit* 

Rename Dictionary doesn't work for LOR, because the key used was just three characters instead of four.

In [ ]:
new_df = new_df.rename(columns={'LOR ': 'Letter of Recommendation'})
new_df.head()

            GRE Score  TOEFL Score  ...  Research  Chance of Admit
Serial No.                          ...
1                 337          118  ...         1              0.92
2                 324          107  ...         1              0.76
3                 316          104  ...         1              0.72
4                 322          110  ...         1              0.80
5                 314          103  ...         0              0.65

[5 rows x 8 columns]

In [ ]:
new_df = new_df.rename(mapper=str.strip, axis='columns')
new_df.head()

            GRE Score  TOEFL Score  ...  Research  Chance of Admit
Serial No.                          ...
1                 337          118  ...         1             0.92
2                 324          107  ...         1             0.76
3                 316          104  ...         1             0.72
4                 322          110  ...         1             0.80
5                 314          103  ...         0             0.65

[5 rows x 8 columns]

In [ ]:
df.columns

Index(['GRE Score', 'TOEFL Score', 'University Rating', 'SOP', 'LOR ', 'CGPA',
       'Research', 'Chance of Admit '],
      dtype='object')

In [ ]:
cols = list(df.columns)
cols = [x.lower().strip() for x in cols]
df.columns = cols
df.head()

            gre score  toefl score  ...  research  chance of admit
Serial No.                          ...
1                 337          118  ...         1             0.92
2                 324          107  ...         1             0.76
3                 316          104  ...         1             0.72
4                 322          110  ...         1             0.80
5                 314          103  ...         0             0.65

[5 rows x 8 columns]

##**Querying a DataFrame**

In [ ]:
admit_mask = df['chance of admit'] > 0.7
admit_mask

Serial No.
1       True
2       True
3       True
4       True
5      False
       ...
396     True
397     True
398     True
399    False
400     True
Name: chance of admit, Length: 400, dtype: bool

In [ ]:
df.where(admit_mask).head()

            gre score  toefl score  ...  research  chance of admit
Serial No.                          ...
1               337.0        118.0  ...       1.0             0.92
2               324.0        107.0  ...       1.0             0.76
3               316.0        104.0  ...       1.0             0.72
4               322.0        110.0  ...       1.0             0.80
5                 NaN          NaN  ...       NaN              NaN

[5 rows x 8 columns]

If we not want **Nan** data, we can use dropna() function. It remove the Nan values and show the next columns without Nan value

In [ ]:
df.where(admit_mask).dropna().head()

            gre score  toefl score  ...  research  chance of admit
Serial No.                          ...
1               337.0        118.0  ...       1.0             0.92
2               324.0        107.0  ...       1.0             0.76
3               316.0        104.0  ...       1.0             0.72
4               322.0        110.0  ...       1.0             0.80
6               330.0        115.0  ...       1.0             0.90

[5 rows x 8 columns]

**To Do above code we have another way to do it**

In [ ]:
df[df['chance of admit'] > 0.7].head()

            gre score  toefl score  ...  research  chance of admit
Serial No.                          ...
1                 337          118  ...         1             0.92
2                 324          107  ...         1             0.76
3                 316          104  ...         1             0.72
4                 322          110  ...         1             0.80
6                 330          115  ...         1             0.90

[5 rows x 8 columns]

In [ ]:
df['gre score'].head()

Serial No.
1    337
2    324
3    316
4    322
5    314
Name: gre score, dtype: int64

In [ ]:
df[['gre score','toefl score']].head()

            gre score  toefl score
Serial No.
1                 337          118
2                 324          107
3                 316          104
4                 322          110
5                 314          103

In [ ]:
df[df['gre score']>320].head()

            gre score  toefl score  ...  research  chance of admit
Serial No.                          ...
1                 337          118  ...         1             0.92
2                 324          107  ...         1             0.76
4                 322          110  ...         1             0.80
6                 330          115  ...         1             0.90
7                 321          109  ...         1             0.75

[5 rows x 8 columns]

In [ ]:
(df['chance of admit'] > 0.7) and (df['chance of admit']< 0.9)

ValueError: ignored

In [ ]:
(df['chance of admit']> 0.7) & (df['chance of admit'] < 0.9)

Serial No.
1      False
2       True
3       True
4       True
5      False
       ...
396    False
397    False
398    False
399    False
400    False
Name: chance of admit, Length: 400, dtype: bool

In [ ]:
df[(df['chance of admit']> 0.7) & (df['chance of admit'] < 0.9)].head()

            gre score  toefl score  ...  research  chance of admit
Serial No.                          ...
2                 324          107  ...         1             0.76
3                 316          104  ...         1             0.72
4                 322          110  ...         1             0.80
7                 321          109  ...         1             0.75
12                327          111  ...         1             0.84

[5 rows x 8 columns]

The problem is that Python is trying to bitwise 0.7 and a panda dataframe, when we really want to bitwise and the broadcasted dataframes together

Another way to do this is to get rid of the comparision operator completely, and instead use the built-in functions which mimic the approach

In [ ]:
df['chance of admit'].gt(0.7) & df['chance of admit'].lt(0.9)

Serial No.
1      False
2       True
3       True
4       True
5      False
       ...
396     True
397     True
398    False
399    False
400    False
Name: chance of admit, Length: 400, dtype: bool

In [ ]:
df['chance of admit'].gt(0.7).lt(0.9)

Serial No.
1      False
2      False
3      False
4      False
5       True
       ...
396    False
397    False
398    False
399     True
400    False
Name: chance of admit, Length: 400, dtype: bool

###**Indexing Data Frames**

In [26]:
df.head()
df.columns

Index(['GRE Score', 'TOEFL Score', 'University Rating', 'SOP', 'LOR ', 'CGPA',
       'Research', 'Chance of Admit '],
      dtype='object')

In [31]:
df['Serial Number'] = df.index
df = df.set_index('Chance of Admit ')
df.head()

                  GRE Score  TOEFL Score  ...  Research  Serial Number
Chance of Admit                           ...
0.92                    337          118  ...         1              1
0.76                    324          107  ...         1              2
0.72                    316          104  ...         1              3
0.80                    322          110  ...         1              4
0.65                    314          103  ...         0              5

[5 rows x 8 columns]

In [32]:
df = df.reset_index()
df.head()

   Chance of Admit   GRE Score  TOEFL Score  ...  CGPA  Research  Serial Number
0              0.92        337          118  ...  9.65         1              1
1              0.76        324          107  ...  8.87         1              2
2              0.72        316          104  ...  8.00         1              3
3              0.80        322          110  ...  8.67         1              4
4              0.65        314          103  ...  8.21         0              5

[5 rows x 9 columns]

In [71]:
df = pd.read_csv('census.csv')
df.head()

   SUMLEV  REGION  DIVISION  ...  RNETMIG2013  RNETMIG2014 RNETMIG2015
0      40       3         6  ...     1.383282     1.724718    0.712594
1      50       3         6  ...    -2.722002     2.592270   -2.187333
2      50       3         6  ...    22.727626    20.317142   18.293499
3      50       3         6  ...    -7.167664    -3.978583  -10.543299
4      50       3         6  ...    -5.403729     0.754533    1.107861

[5 rows x 100 columns]

In [72]:
df['SUMLEV'].unique()

array([40, 50])

In [73]:
df=df[df['SUMLEV'] == 50]
df.head()

   SUMLEV  REGION  DIVISION  ...  RNETMIG2013  RNETMIG2014 RNETMIG2015
1      50       3         6  ...    -2.722002     2.592270   -2.187333
2      50       3         6  ...    22.727626    20.317142   18.293499
3      50       3         6  ...    -7.167664    -3.978583  -10.543299
4      50       3         6  ...    -5.403729     0.754533    1.107861
5      50       3         6  ...    -1.402476    -1.577232   -0.884411

[5 rows x 100 columns]

In [74]:
column_to_keep = ['STNAME', 'CTYNAME', 'BIRTHS2010', 'BIRTHS2011', 'BIRTHS2012', 'BIRTHS2013', 'BIRTHS2014', 'BIRTHS2015', 'POPESTIMATE2010', 'POPESTIMATE2011', 'POPESTIMATE2012', 'POPESTIMATE2013', 'POPESTIMATE2014', 'POPESTIMATE2015']
df = df[column_to_keep]
df.head()

    STNAME         CTYNAME  ...  POPESTIMATE2014  POPESTIMATE2015
1  Alabama  Autauga County  ...            55290            55347
2  Alabama  Baldwin County  ...           199713           203709
3  Alabama  Barbour County  ...            26815            26489
4  Alabama     Bibb County  ...            22549            22583
5  Alabama   Blount County  ...            57658            57673

[5 rows x 14 columns]

In [75]:
df = df.set_index(['STNAME', 'CTYNAME'])
df.head()

                        BIRTHS2010  ...  POPESTIMATE2015
STNAME  CTYNAME                     ...
Alabama Autauga County         151  ...            55347
        Baldwin County         517  ...           203709
        Barbour County          70  ...            26489
        Bibb County             44  ...            22583
        Blount County          183  ...            57673

[5 rows x 12 columns]

In [76]:
df.tail()

                           BIRTHS2010  ...  POPESTIMATE2015
STNAME   CTYNAME                       ...
Michigan Clinton County           197  ...            77390
         Crawford County           36  ...            13801
         Delta County              81  ...            36377
         Dickinson County          58  ...            25788
         Eaton County             282  ...           108801

[5 rows x 12 columns]

In [78]:
df.loc['Michigan', 'Eaton County']

BIRTHS2010            282
BIRTHS2011           1194
BIRTHS2012           1129
BIRTHS2013           1178
BIRTHS2014           1143
BIRTHS2015           1159
POPESTIMATE2010    107758
POPESTIMATE2011    107882
POPESTIMATE2012    108023
POPESTIMATE2013    108292
POPESTIMATE2014    108706
POPESTIMATE2015    108801
Name: (Michigan, Eaton County), dtype: int64

In [82]:
df.loc[[('Michigan', 'Eaton County'), ('Michigan', 'Dickinson County')]  ]

                           BIRTHS2010  ...  POPESTIMATE2015
STNAME   CTYNAME                       ...
Michigan Eaton County             282  ...           108801
         Dickinson County          58  ...            25788

[2 rows x 12 columns]

###**Missing Values**

In [92]:
df = pd.read_csv('grades.csv')
df.head(10)

   Prefix  Assignment  Tutorial  Midterm  TakeHome  Final
0       5       57.14     34.09    64.38     51.48  52.50
1       8       95.05    105.49    67.50     99.07  68.33
2       8       83.70     83.17    30.00     63.15  48.89
3       7       81.22     96.06    49.38    105.93  80.56
4       8       91.32     93.64    95.00    107.41  73.89
5       7       95.00     92.58    93.12     97.78  68.06
6       8       95.05    102.99    56.25     99.07  50.00
7       7       72.85     86.85    60.00       NaN  56.11
8       8       84.26     93.10    47.50     18.52  50.83
9       7       90.10     97.55    51.25     88.89  63.61

In [99]:
mask = df.isnull()
mask.head(10)

   Prefix  Assignment  Tutorial  Midterm  TakeHome  Final
0   False       False     False    False     False  False
1   False       False     False    False     False  False
2   False       False     False    False     False  False
3   False       False     False    False     False  False
4   False       False     False    False     False  False
5   False       False     False    False     False  False
6   False       False     False    False     False  False
7   False       False     False    False     False  False
8   False       False     False    False     False  False
9   False       False     False    False     False  False

In [95]:
df.dropna().head()

   Prefix  Assignment  Tutorial  Midterm  TakeHome  Final
0       5       57.14     34.09    64.38     51.48  52.50
1       8       95.05    105.49    67.50     99.07  68.33
2       8       83.70     83.17    30.00     63.15  48.89
3       7       81.22     96.06    49.38    105.93  80.56
4       8       91.32     93.64    95.00    107.41  73.89

In [96]:
df.fillna(0, inplace=True)

In [98]:
df.head(10)

   Prefix  Assignment  Tutorial  Midterm  TakeHome  Final
0       5       57.14     34.09    64.38     51.48  52.50
1       8       95.05    105.49    67.50     99.07  68.33
2       8       83.70     83.17    30.00     63.15  48.89
3       7       81.22     96.06    49.38    105.93  80.56
4       8       91.32     93.64    95.00    107.41  73.89
5       7       95.00     92.58    93.12     97.78  68.06
6       8       95.05    102.99    56.25     99.07  50.00
7       7       72.85     86.85    60.00      0.00  56.11
8       8       84.26     93.10    47.50     18.52  50.83
9       7       90.10     97.55    51.25     88.89  63.61

In [100]:
 df = pd.read_csv('log.csv')
 df.head(20)

          time    user          video  playback position paused  volume
0   1469974424  cheryl     intro.html                  5  False    10.0
1   1469974454  cheryl     intro.html                  6    NaN     NaN
2   1469974544  cheryl     intro.html                  9    NaN     NaN
3   1469974574  cheryl     intro.html                 10    NaN     NaN
4   1469977514     bob     intro.html                  1    NaN     NaN
5   1469977544     bob     intro.html                  1    NaN     NaN
6   1469977574     bob     intro.html                  1    NaN     NaN
7   1469977604     bob     intro.html                  1    NaN     NaN
8   1469974604  cheryl     intro.html                 11    NaN     NaN
9   1469974694  cheryl     intro.html                 14    NaN     NaN
10  1469974724  cheryl     intro.html                 15    NaN     NaN
11  1469974454     sue  advanced.html                 24    NaN     NaN
12  1469974524     sue  advanced.html                 25    NaN     NaN
13  1469974424     sue  advanced.html                 23  False    10.0
14  1469974554     sue  advanced.html                 26    NaN     NaN
15  1469974624     sue  advanced.html                 27    NaN     NaN
16  1469974654     sue  advanced.html                 28    NaN     5.0
17  1469974724     sue  advanced.html                 29    NaN     NaN
18  1469974484  cheryl     intro.html                  7    NaN     NaN
19  1469974514  cheryl     intro.html                  8    NaN     NaN

As in above data set with increase in playback position there is a increase of 30 second in the time stamp

In [102]:
df = df.set_index('time')
df = df.sort_index()
df.head(20)

              user          video  playback position paused  volume
time
1469974424  cheryl     intro.html                  5  False    10.0
1469974424     sue  advanced.html                 23  False    10.0
1469974454  cheryl     intro.html                  6    NaN     NaN
1469974454     sue  advanced.html                 24    NaN     NaN
1469974484  cheryl     intro.html                  7    NaN     NaN
1469974514  cheryl     intro.html                  8    NaN     NaN
1469974524     sue  advanced.html                 25    NaN     NaN
1469974544  cheryl     intro.html                  9    NaN     NaN
1469974554     sue  advanced.html                 26    NaN     NaN
1469974574  cheryl     intro.html                 10    NaN     NaN
1469974604  cheryl     intro.html                 11    NaN     NaN
1469974624     sue  advanced.html                 27    NaN     NaN
1469974634  cheryl     intro.html                 12    NaN     NaN
1469974654     sue  advanced.html                 28    NaN     5.0
1469974664  cheryl     intro.html                 13    NaN     NaN
1469974694  cheryl     intro.html                 14    NaN     NaN
1469974724  cheryl     intro.html                 15    NaN     NaN
1469974724     sue  advanced.html                 29    NaN     NaN
1469974754     sue  advanced.html                 30    NaN     NaN
1469974824     sue  advanced.html                 31    NaN     NaN

In [103]:
df = df.reset_index()

In [104]:
df = df.set_index(['time', 'user'])

In [106]:
df.head(10)

                           video  playback position paused  volume
time       user
1469974424 cheryl     intro.html                  5  False    10.0
           sue     advanced.html                 23  False    10.0
1469974454 cheryl     intro.html                  6    NaN     NaN
           sue     advanced.html                 24    NaN     NaN
1469974484 cheryl     intro.html                  7    NaN     NaN
1469974514 cheryl     intro.html                  8    NaN     NaN
1469974524 sue     advanced.html                 25    NaN     NaN
1469974544 cheryl     intro.html                  9    NaN     NaN
1469974554 sue     advanced.html                 26    NaN     NaN
1469974574 cheryl     intro.html                 10    NaN     NaN

Now that we have the data indexed and sorted approximately, we can fill the missing datas using ```ffill```. 

It's good to remember when dealing with missing values so you can deal with individual columns or sets of columns by protecting them. So you don't have to fix all missing values in one command.

In [107]:
df = df.fillna(method='ffill')
df.head()

                           video  playback position  paused  volume
time       user
1469974424 cheryl     intro.html                  5   False    10.0
           sue     advanced.html                 23   False    10.0
1469974454 cheryl     intro.html                  6   False    10.0
           sue     advanced.html                 24   False    10.0
1469974484 cheryl     intro.html                  7   False    10.0

Also do customized fill-in to replace the values with the ```replace()``` function.

 It allows replacement from several approaches: value-to-value, list, dictionary, regex

In [108]:
df = pd.DataFrame({'A':[1, 2, 3, 4, 5],
                   'B':[6, 7, 8, 9, 1],
                   'C': ['a','b', 'c', 'd', 'e']})
df

   A  B  C
0  1  6  a
1  2  7  b
2  3  8  c
3  4  9  d
4  5  1  e

In [109]:
df.replace(1, 100)

     A    B  C
0  100    6  a
1    2    7  b
2    3    8  c
3    4    9  d
4    5  100  e

In [111]:
df.replace([1, 3], [10, 300])

     A   B  C
0   10   6  a
1    2   7  b
2  300   8  c
3    4   9  d
4    5  10  e

In [112]:
df = pd.read_csv('log.csv')
df.head(20)

          time    user          video  playback position paused  volume
0   1469974424  cheryl     intro.html                  5  False    10.0
1   1469974454  cheryl     intro.html                  6    NaN     NaN
2   1469974544  cheryl     intro.html                  9    NaN     NaN
3   1469974574  cheryl     intro.html                 10    NaN     NaN
4   1469977514     bob     intro.html                  1    NaN     NaN
5   1469977544     bob     intro.html                  1    NaN     NaN
6   1469977574     bob     intro.html                  1    NaN     NaN
7   1469977604     bob     intro.html                  1    NaN     NaN
8   1469974604  cheryl     intro.html                 11    NaN     NaN
9   1469974694  cheryl     intro.html                 14    NaN     NaN
10  1469974724  cheryl     intro.html                 15    NaN     NaN
11  1469974454     sue  advanced.html                 24    NaN     NaN
12  1469974524     sue  advanced.html                 25    NaN     NaN
13  1469974424     sue  advanced.html                 23  False    10.0
14  1469974554     sue  advanced.html                 26    NaN     NaN
15  1469974624     sue  advanced.html                 27    NaN     NaN
16  1469974654     sue  advanced.html                 28    NaN     5.0
17  1469974724     sue  advanced.html                 29    NaN     NaN
18  1469974484  cheryl     intro.html                  7    NaN     NaN
19  1469974514  cheryl     intro.html                  8    NaN     NaN

To replace using ```regex``` asks first parameter to replace the regex pattern we want to match, the second parameter the value we want to emit upon match, and then we pass in a third parameter ``` "regex=True"```

###**Manupulating DataFrames**

In [114]:
df = pd.read_csv('presidents.csv')
df.head()

   Presidency          President   ...                  Party      Home State
0            1  George Washington  ...            Independent        Virginia
1            2         John Adams  ...             Federalist   Massachusetts
2            3   Thomas Jefferson  ...  Democratic-Republican        Virginia
3            4      James Madison  ...  Democratic-Republican        Virginia
4            5       James Monroe  ...  Democratic-Republican        Virginia

[5 rows x 6 columns]

In [116]:
df['First'] = df['President ']

In [117]:
df['First']=df['First'].replace("[ ].*", "", regex=True)
df.head()

   Presidency          President   ...     Home State   First
0            1  George Washington  ...       Virginia  George
1            2         John Adams  ...  Massachusetts    John
2            3   Thomas Jefferson  ...       Virginia  Thomas
3            4      James Madison  ...       Virginia   James
4            5       James Monroe  ...       Virginia   James

[5 rows x 7 columns]

In [118]:
del(df['First'])

In [127]:
def splitname(row):
  row['First'] = row['President '].split(" ")[0]
  row['Last'] = row['President '].split(" ")[-1]
  return row

df= df.apply(splitname, axis="columns")
df.head()

   Presidency          President   ...   First        Last
0            1  George Washington  ...  George  Washington
1            2         John Adams  ...    John       Adams
2            3   Thomas Jefferson  ...  Thomas   Jefferson
3            4      James Madison  ...   James     Madison
4            5       James Monroe  ...   James      Monroe

[5 rows x 8 columns]

In [126]:
pattern = "(^[\w]*)(?:.* )([\w]*$)"

df["President "].str.extract(pattern).head()

        0           1
0  George  Washington
1    John       Adams
2  Thomas   Jefferson
3   James     Madison
4   James      Monroe

In [130]:
pattern = "(?P<First>^[\w]*)(?:.* )(?P<Last>[\w]*$)"
names = df['President '].str.extract(pattern).head()

In [131]:
names

    First        Last
0  George  Washington
1    John       Adams
2  Thomas   Jefferson
3   James     Madison
4   James      Monroe

In [132]:
df['First']=names['First']
df['Last']=names['Last']
df

    Presidency                    President   ...   First        Last
0             1            George Washington  ...  George  Washington
1             2                   John Adams  ...    John       Adams
2             3             Thomas Jefferson  ...  Thomas   Jefferson
3             4                James Madison  ...   James     Madison
4             5                 James Monroe  ...   James      Monroe
5             6            John Quincy Adams  ...     NaN         NaN
6             7               Andrew Jackson  ...     NaN         NaN
7             8             Martin Van Buren  ...     NaN         NaN
8             9       William Henry Harrison  ...     NaN         NaN
9            10                   John Tyler  ...     NaN         NaN
10           11                James K. Polk  ...     NaN         NaN
11           12               Zachary Taylor  ...     NaN         NaN
12           13             Millard Fillmore  ...     NaN         NaN
13           14              Franklin Pierce  ...     NaN         NaN
14           15               James Buchanan  ...     NaN         NaN
15           16              Abraham Lincoln  ...     NaN         NaN
16           17               Andrew Johnson  ...     NaN         NaN
17           18             Ulysses S. Grant  ...     NaN         NaN
18           19          Rutherford B. Hayes  ...     NaN         NaN
19           20            James A. Garfield  ...     NaN         NaN
20           21            Chester A. Arthur  ...     NaN         NaN
21           22             Grover Cleveland  ...     NaN         NaN
22           23            Benjamin Harrison  ...     NaN         NaN
23           24  Grover Cleveland (2nd term)  ...     NaN         NaN
24           25             William McKinley  ...     NaN         NaN
25           26           Theodore Roosevelt  ...     NaN         NaN
26           27          William Howard Taft  ...     NaN         NaN
27           28               Woodrow Wilson  ...     NaN         NaN
28           29            Warren G. Harding  ...     NaN         NaN
29           30              Calvin Coolidge  ...     NaN         NaN
30           31               Herbert Hoover  ...     NaN         NaN
31           32        Franklin D. Roosevelt  ...     NaN         NaN
32           33              Harry S. Truman  ...     NaN         NaN
33           34         Dwight D. Eisenhower  ...     NaN         NaN
34           35              John F. Kennedy  ...     NaN         NaN
35           36            Lyndon B. Johnson  ...     NaN         NaN
36           37                Richard Nixon  ...     NaN         NaN
37           38                  Gerald Ford  ...     NaN         NaN
38           39                 Jimmy Carter  ...     NaN         NaN
39           40                Ronald Reagan  ...     NaN         NaN
40           41            George H. W. Bush  ...     NaN         NaN
41           42                 Bill Clinton  ...     NaN         NaN
42           43               George W. Bush  ...     NaN         NaN
43           44                 Barack Obama  ...     NaN         NaN

[44 rows x 8 columns]